In [75]:
import numpy as np
import pandas as pd
import psycopg
from sqlalchemy import create_engine
import dotenv
import os
dotenv.load_dotenv()

True

In [76]:
POSTGRES_PASSWORD = os.getenv('POSTGRES_PASSWORD')

### Step 1: After docker compose up, connect to the Postgres server

In [128]:
dbserver = psycopg.connect(
    dbname="arxiv",
    host="localhost",
    port="5432",
    user="postgres",
    password=POSTGRES_PASSWORD
)
dbserver.autocommit = True

### Step 2: Create an empty arxiv dataframe on the server

In [4]:
cursor = dbserver.cursor()
try:
    cursor.execute("CREATE DATABASE arxiv")
except:
    cursor.execute("DROP DATABASE arxiv")
    cursor.execute("CREATE DATABASE arxiv")

### Step 3: Create a connection to the new empty database using SQLalchemy

In [127]:
dbms = 'postgresql'
package = 'psycopg'
user = 'postgres'
password = POSTGRES_PASSWORD
host = 'localhost'
port = '5432'
db = 'arxiv'

engine = create_engine(f'{dbms}+{package}://{user}:{password}@{host}:{port}/{db}')
engine

Engine(postgresql+psycopg://postgres:***@localhost:5432/arxiv)

### Step 4: Upload the data to our new postgres arxiv DB

In [6]:
data_path = "../data/arxiv-metadata-oai-snapshot.json"


chunksize = 100_000
for i, chunk in enumerate(pd.read_json(data_path, lines=True, chunksize=chunksize)):

    chunk['id'] = chunk['id'].astype(str)
    chunk['date'] = pd.to_datetime(chunk['update_date'])
    chunk['year'] = chunk['date'].dt.year
    
    # Keep only relevant columns and rename
    papers = chunk[[
        'id', 'title', 'abstract', 'authors', 'categories',
        'year', 'date', 'doi', 'journal-ref', 'comments'
    ]].rename(columns={
        'journal-ref': 'journal_ref',
        'authors': 'authors_raw'
    })
    
    # Replace NaNs with None for SQL
    papers = papers.where(pd.notnull(papers), None)
    
    # Load chunk into Postgres
    papers.to_sql("papers", engine, if_exists="append", index=False, chunksize=1000)
    
    print(f"Chunk {i+1} inserted")

print("All data uploaded successfully!")

Chunk 1 inserted
Chunk 2 inserted
Chunk 3 inserted
Chunk 4 inserted
Chunk 5 inserted
Chunk 6 inserted
Chunk 7 inserted
Chunk 8 inserted
Chunk 9 inserted
Chunk 10 inserted
Chunk 11 inserted
Chunk 12 inserted
Chunk 13 inserted
Chunk 14 inserted
Chunk 15 inserted
Chunk 16 inserted
Chunk 17 inserted
Chunk 18 inserted
Chunk 19 inserted
Chunk 20 inserted
Chunk 21 inserted
Chunk 22 inserted
Chunk 23 inserted
Chunk 24 inserted
Chunk 25 inserted
Chunk 26 inserted
Chunk 27 inserted
Chunk 28 inserted
Chunk 29 inserted
Chunk 30 inserted
All data uploaded successfully!

In [5]:
myquery = '''
SELECT id, title, year
FROM papers
WHERE year >= 2020 And title ILIKE '%%llm%%'
ORDER BY year DESC
LIMIT 10;
'''

pd.read_sql_query(myquery, con=engine)

           id                                              title  year
0  2103.15382  Willmore obstacle problems under Dirichlet bou...  2025
1    2301.025  Violation of Diagonal Non-Invasiveness: A Hall...  2025
2  2305.00948  Large Linguistic Models: Investigating LLMs' m...  2025
3    2502.129  Soundwave: Less is More for Speech-Text Alignm...  2025
4  2208.08067  K-ASTRO: Structure-Aware Adaptation of LLMs fo...  2025
5  2104.12145  LLM4Laser: Large Language Models Automate the ...  2025
6  2208.09067  Dynamic Order Fulfillment in Last-Mile Drone D...  2025
7  2212.10678  Causally Testing Gender Bias in LLMs: A Case S...  2025
8  2008.11477  Bellman filtering and smoothing for state-spac...  2025
9  2305.06018  TARGET: Automated Scenario Generation from Tra...  2025

In [ ]:
data_path = "../data/arxiv-metadata-oai-snapshot.json"

def get_date(versions):
    if versions and len(versions) > 0:
        return versions[0].get('created')
    return None

chunksize = 100_000
for i, chunk in enumerate(pd.read_json(data_path, lines=True, chunksize=chunksize)):

    chunk['id'] = chunk['id'].astype(str)
    chunk['submitted_date'] = pd.to_datetime(chunk['versions'].apply(get_date))
    chunk['submitted_year'] = chunk['submitted_date'].dt.year
    
    # Keep only relevant columns and rename
    papers = chunk[[
        'id', 'title', 'abstract', 'authors', 'categories',
        'submitted_year', 'submitted_date', 'doi', 'journal-ref', 'comments'
    ]].rename(columns={
        'journal-ref': 'journal_ref',
        'authors': 'authors_raw'
    })
    
    # Replace NaNs with None for SQL
    papers = papers.where(pd.notnull(papers), None)
    
    # Load chunk into Postgres
    papers.to_sql("papers2", engine, if_exists="append", index=False, chunksize=1000)
    
    print(f"Chunk {i+1} inserted")

print("All data uploaded successfully!")

Chunk 1 inserted
Chunk 2 inserted
Chunk 3 inserted
Chunk 4 inserted
Chunk 5 inserted
Chunk 6 inserted
Chunk 7 inserted
Chunk 8 inserted
Chunk 9 inserted
Chunk 10 inserted
Chunk 11 inserted
Chunk 12 inserted
Chunk 13 inserted
Chunk 14 inserted
Chunk 15 inserted
Chunk 16 inserted
Chunk 17 inserted
Chunk 18 inserted
Chunk 19 inserted
Chunk 20 inserted
Chunk 21 inserted
Chunk 22 inserted
Chunk 23 inserted
Chunk 24 inserted
Chunk 25 inserted
Chunk 26 inserted
Chunk 27 inserted
Chunk 28 inserted
Chunk 29 inserted
Chunk 30 inserted
All data uploaded successfully!

In [6]:
myquery = '''
SELECT id, title, submitted_date, authors_raw
FROM papers2
WHERE authors_raw ILIKE '%%Pengrui Han%%'
ORDER BY submitted_date DESC
LIMIT 100;
'''

pd.read_sql_query(myquery, con=engine)

,id,title,submitted_date,authors_raw
0,2510.17725,AcademicEval: Live Long-Context LLM Benchmark,2025-10-20 16:42:30,"Haozhen Zhang, Tao Feng, Pengrui Han, Jiaxuan You"
1,2509.25370,Where LLM Agents Fail and How They can Learn F...,2025-09-29 18:20:27,"Kunlun Zhu, Zijia Liu, Bingxuan Li, Muxin Tian..."
2,2509.03730,The Personality Illusion: Revealing Dissociati...,2025-09-03 21:27:10,"Pengrui Han, Rafal Kocielnik, Peiyang Song, Ra..."
3,2507.1054,FusionFactory: Fusing LLM Capabilities with Mu...,2025-07-14 17:58:02,"Tao Feng, Haozhen Zhang, Zijie Lei, Pengrui Ha..."
4,2409.15454,In-Context Learning May Not Elicit Trustworthy...,2024-09-23 18:30:31,"Pengrui Han, Peiyang Song, Haofei Yu, Jiaxuan You"
5,2409.04593,Paper Copilot: A Self-Evolving and Efficient L...,2024-09-06 20:04:04,"Guanyu Lin, Tao Feng, Pengrui Han, Ge Liu, Jia..."
6,2402.11764,ChatGPT Based Data Augmentation for Improved P...,2024-02-19 01:28:48,"Pengrui Han, Rafal Kocielnik, Adhithya Saravan..."
7,2312.10065,Exploring Social Bias in Downstream Applicatio...,2023-12-05 14:36:49,"Adhithya Prakash Saravanan, Rafal Kocielnik, R..."

### Author pre-aggregation

In [ ]:
cursor = dbserver.cursor()
cursor.execute("DROP TABLE IF EXISTS author_counts;")
dbserver.commit()

In [66]:
myquery = r'''
CREATE TABLE author_counts AS
SELECT 
    trim(regexp_replace(trim(author), '[\n\r]+', ' ', 'g')) AS author,
    year,
    COUNT(*) AS paper_count
FROM (
    SELECT
        unnest(regexp_split_to_array(authors_raw, ',|\s+and\s+')) AS author,
        submitted_year AS year
    FROM papers2
)
GROUP BY trim(regexp_replace(trim(author), '[\n\r]+', ' ', 'g')), year
ORDER BY author, year;
'''

cursor = dbserver.cursor()
cursor.execute(myquery)
dbserver.commit()

In [73]:
cursor.execute("CREATE INDEX idx_author_counts ON author_counts(author, year);")
dbserver.commit()

In [6]:
myquery = '''
SELECT *
FROM author_counts
WHERE author = 'Andrea L. Bertozzi'
ORDER BY year;
'''

pd.read_sql_query(myquery, con=engine)

                author  year  paper_count
0   Andrea L. Bertozzi  2002            1
1   Andrea L. Bertozzi  2005            1
2   Andrea L. Bertozzi  2012            3
3   Andrea L. Bertozzi  2013            3
4   Andrea L. Bertozzi  2014            1
5   Andrea L. Bertozzi  2015            1
6   Andrea L. Bertozzi  2016            1
7   Andrea L. Bertozzi  2017            5
8   Andrea L. Bertozzi  2018            8
9   Andrea L. Bertozzi  2019            4
10  Andrea L. Bertozzi  2020            9
11  Andrea L. Bertozzi  2021            5
12  Andrea L. Bertozzi  2022            4
13  Andrea L. Bertozzi  2023            6
14  Andrea L. Bertozzi  2024            7
15  Andrea L. Bertozzi  2025           10

In [19]:
pd.set_option('display.max_colwidth', None)

myquery = '''
SELECT authors_raw, submitted_year, COUNT(*)
FROM papers2
WHERE authors_raw ILIKE '%%Thomas Hartvigsen%%'
GROUP BY authors_raw, submitted_year
ORDER BY submitted_year;
'''

pd.read_sql_query(myquery, con=engine)

,authors_raw,submitted_year,count
0,"Aparna Balagopalan, Haoran Zhang, Kimia Hamidieh, Thomas Hartvigsen,\n Frank Rudzicz, Marzyeh Ghassemi",2022,1
1,"Ruofan Hu, Dongyu Zhang, Dandan Tao, Thomas Hartvigsen, Hao Feng, Elke\n Rundensteiner",2022,1
2,"Thomas Hartvigsen, Saadia Gabriel, Hamid Palangi, Maarten Sap,\n Dipankar Ray, Ece Kamar",2022,1
3,"Thomas Hartvigsen, Swami Sankaranarayanan, Hamid Palangi, Yoon Kim,\n Marzyeh Ghassemi",2022,1
4,"Thomas Hartvigsen, Walter Gerych, Jidapa Thadajarassiri, Xiangnan\n Kong, Elke Rundensteiner",2022,1
5,Hang Yin and Yao Su and Xinyue Liu and Thomas Hartvigsen and Yanhua Li\n and Xiangnan Kong,2023,1
6,"Owen Queen, Thomas Hartvigsen, Teddy Koker, Huan He, Theodoros\n Tsiligkaridis, Marinka Zitnik",2023,1
7,"Stefan Hegselmann, Antonio Parziale, Divya Shanmugam, Shengpu Tang,\n Mercy Nyamewaa Asiedu, Serina Chang, Thomas Hartvigsen, Harvineet Singh",2023,1
8,"Taylor W. Killian, Haoran Zhang, Thomas Hartvigsen, Ava P. Amini",2023,1
9,"Thomas Hartvigsen, Jidapa Thadajarassiri, Xiangnan Kong, Elke\n Rundensteiner",2023,1
10,"Tianhua Zhang, Hongyin Luo, Yung-Sung Chuang, Wei Fang, Luc Gaitskell,\n Thomas Hartvigsen, Xixin Wu, Danny Fox, Helen Meng, James Glass",2023,1
11,"Arinbjorn Kolbeinsson, Kyle O'Brien, Tianjin Huang, Shanghua Gao,\n Shiwei Liu, Jonathan Richard Schwarz, Anurag Vaidya, Faisal Mahmood, Marinka\n Zitnik, Tianlong Chen, Thomas Hartvigsen",2024,1
12,"Bryan R Christ, Jonathan Kropko, Thomas Hartvigsen",2024,1
13,"Bryan R. Christ, Zack Gottesman, Jonathan Kropko, Thomas Hartvigsen",2024,1
14,"Derek Powell, Walter Gerych, Thomas Hartvigsen",2024,1
15,Hang Yin and Yao Su and Liping Liu and Thomas Hartvigsen and Xin Dai\n and Xiangnan Kong,2024,1
16,"Jack Gallifant, Shan Chen, Pedro Moreira, Nikolaj Munch, Mingye Gao,\n Jackson Pond, Leo Anthony Celi, Hugo Aerts, Thomas Hartvigsen, Danielle\n Bitterman",2024,1
17,"Kimia Hamidieh, Haoran Zhang, Walter Gerych, Thomas Hartvigsen,\n Marzyeh Ghassemi",2024,1
18,"Kumail Alhamoud, Yasir Ghunaim, Motasem Alfarra, Thomas Hartvigsen,\n Philip Torr, Bernard Ghanem, Adel Bibi, Marzyeh Ghassemi",2024,1
19,"Kyle O'Brien, Nathan Ng, Isha Puri, Jorge Mendez, Hamid Palangi, Yoon\n Kim, Marzyeh Ghassemi, Thomas Hartvigsen",2024,1
20,"Matthew Landers, Taylor W. Killian, Hugo Barnes, Thomas Hartvigsen, Afsaneh Doryab",2024,1
21,"Shan Chen, Mingye Gao, Kuleen Sasse, Thomas Hartvigsen, Brian Anthony,\n Lizhou Fan, Hugo Aerts, Jack Gallifant, Danielle Bitterman",2024,1
22,"Shanghua Gao, Teddy Koker, Owen Queen, Thomas Hartvigsen, Theodoros\n Tsiligkaridis, Marinka Zitnik",2024,1
23,"Shenghuan Sun, Alexander Schubert, Gregory M. Goldgof, Zhiqing Sun,\n Thomas Hartvigsen, Atul J. Butte, Ahmed Alaa",2024,1
24,"Sujay Nagaraj, Walter Gerych, Sana Tonekaboni, Anna Goldenberg, Berk\n Ustun, Thomas Hartvigsen",2024,1
25,"Walter Gerych, Haoran Zhang, Kimia Hamidieh, Eileen Pan, Maanas\n Sharma, Thomas Hartvigsen, Marzyeh Ghassemi",2024,1
26,"Xu Ouyang, Tao Ge, Thomas Hartvigsen, Zhisong Zhang, Haitao Mi, Dong\n Yu",2024,1
27,"Ahmed Alaa, Thomas Hartvigsen, Niloufar Golchini, Shiladitya Dutta,\n Frances Dean, Inioluwa Deborah Raji, Travis Zack",2025,1
28,"Akshat Gupta, Christine Fang, Atahan Ozdemir, Maochuan Lu, Ahmed Alaa,\n Thomas Hartvigsen, Gopala Anumanchipalli",2025,1
29,"Akshat Gupta, Maochuan Lu, Thomas Hartvigsen, Gopala Anumanchipalli",2025,1
30,"Akshat Gupta, Phudish Prateepamornkul, Maochuan Lu, Ahmed Alaa, Thomas Hartvigsen, Gopala Anumanchipalli",2025,1
31,"Ashima Suvarna, Christina Chance, Karolina Naranjo, Hamid Palangi, Sophie Hao, Thomas Hartvigsen, Saadia Gabriel",2025,1
32,"Bryan R. Christ, Penelope Molitz, Jonathan Kropko, Thomas Hartvigsen",2025,1
33,"Dongliang Guo, Mengxuan Hu, Zihan Guan, Thomas Hartvigsen, Sheng Li",2025,1
34,"Himanshu Beniwal, Youngwoo Kim, Maarten Sap, Soham Dan, Thomas Hartvigsen",2025,1
35,"Jameson Sandler, Jacob K. Christopher, Thomas Hartvigsen, Ferdinando Fioretto",2025,1
36,"Lucas H. McCabe, Rimon Melamed, Thomas Hartvigsen, H. Howie Huang",2025,1
37,"Matthew Landers, Taylor W. Killian, Thomas Hartvigsen, Afsaneh Doryab",2025,1
38,"Michael Cardei, Jacob K Christopher, Thomas Hartvigsen, Brian R. Bartoldson, Bhavya Kailkhura, Ferdinando Fioretto",2025,1
39,"Priyanshu Kumar, Devansh Jain, Akhila Yerukola, Liwei Jiang, Himanshu Beniwal, Thomas Hartvigsen, Maarten Sap",2025,1
40,"Runtao Zhou, Guangya Wan, Saadia Gabriel, Sheng Li, Alexander J Gates,\n Maarten Sap, Thomas Hartvigsen",2025,1
41,"Shan Chen, Pedro Moreira, Yuxin Xiao, Sam Schmidgall, Jeremy Warner, Hugo Aerts, Thomas Hartvigsen, Jack Gallifant, Danielle S. Bitterman",2025,1
42,"Shengzhuang Chen, Xu Ouyang, Michael Arthur Leopold Pearce, Thomas Hartvigsen, Jonathan Richard Schwarz",2025,1
43,"Yash Kumar Atri, Ahmed Alaa, Thomas Hartvigsen",2025,1
44,"Yash Kumar Atri, Thomas H Shin, Thomas Hartvigsen",2025,1
45,"Youngwoo Kim, Himanshu Beniwal, Steven L. Johnson, Thomas Hartvigsen",2025,1
46,"Yuxin Xiao, Shan Chen, Jack Gallifant, Danielle Bitterman, Thomas Hartvigsen, Marzyeh Ghassemi",2025,1

### Default Plot

In [84]:
query = """
CREATE TABLE homepage AS
SELECT submitted_year AS year, COUNT(*) AS count
FROM papers2
GROUP BY submitted_year
ORDER BY submitted_year
"""

cursor = dbserver.cursor()
cursor.execute(query)
dbserver.commit()

In [85]:
myquery = '''
SELECT *
FROM homepage
'''

pd.read_sql_query(myquery, con=engine)

    year   count
0   1986       1
1   1988       1
2   1989       6
3   1990      26
4   1991     353
5   1992    3190
6   1993    6729
7   1994   10078
8   1995   13006
9   1996   15872
10  1997   19610
11  1998   24170
12  1999   27700
13  2000   30671
14  2001   33140
15  2002   36107
16  2003   39394
17  2004   43714
18  2005   46881
19  2006   50314
20  2007   55752
21  2008   58810
22  2009   64071
23  2010   70288
24  2011   76602
25  2012   84374
26  2013   92875
27  2014   97590
28  2015  105130
29  2016  113440
30  2017  123781
31  2018  140377
32  2019  155917
33  2020  178275
34  2021  181599
35  2022  185987
36  2023  209223
37  2024  243690
38  2025  263510

### LLM trend

In [ ]:
myquery = '''
CREATE TABLE llm AS
SELECT submitted_year AS year, COUNT(*)
FROM papers2
WHERE (title ILIKE '%%Large Language Models%%' OR abstract ILIKE '%%Large Language Models%%')
GROUP BY submitted_year
ORDER BY submitted_year;
'''

cursor = dbserver.cursor()
cursor.execute(myquery)
dbserver.commit()

In [ ]:
myquery = '''
SELECT *
FROM llm
'''

pd.read_sql_query(myquery, con=engine)

   year  count
0  2012      1
1  2018      1
2  2019      8
3  2020     14
4  2021     79
5  2022    415
6  2023   5463
7  2024  15004
8  2025  23366

In [124]:
myquery = '''
CREATE TABLE dl AS
SELECT submitted_year AS year, COUNT(*)
FROM papers2
WHERE (title ILIKE '%%Deep Learning%%' OR abstract ILIKE '%%Deep Learning%%')
GROUP BY submitted_year
ORDER BY submitted_year;
'''

cursor = dbserver.cursor()
cursor.execute(myquery)
dbserver.commit()

In [129]:
myquery = '''
CREATE TABLE ml AS
SELECT submitted_year AS year, COUNT(*)
FROM papers2
WHERE (title ILIKE '%%Machine Learning%%' OR abstract ILIKE '%%Machine Learning%%')
GROUP BY submitted_year
ORDER BY submitted_year;
'''

cursor = dbserver.cursor()
cursor.execute(myquery)
dbserver.commit()

In [130]:
myquery = '''
CREATE TABLE rl AS
SELECT submitted_year AS year, COUNT(*)
FROM papers2
WHERE (title ILIKE '%%Reinforcement Learning%%' OR abstract ILIKE '%%Reinforcement Learning%%')
GROUP BY submitted_year
ORDER BY submitted_year;
'''

cursor = dbserver.cursor()
cursor.execute(myquery)
dbserver.commit()

### Default Table

In [16]:
myquery = '''
CREATE TABLE default_table AS
SELECT id, 
       title, 
       authors_raw AS authors, 
       categories, 
       DATE(submitted_date) AS date, 
       comments
FROM papers2
ORDER BY submitted_date DESC
LIMIT 100
'''

cursor = dbserver.cursor()
cursor.execute(myquery)
dbserver.commit()

### Category Distribution

In [103]:
myquery = """
CREATE TABLE recent AS
SELECT categories
FROM papers2
ORDER BY submitted_date DESC
LIMIT 10000
"""

cursor = dbserver.cursor()
cursor.execute(myquery)
dbserver.commit()

In [104]:
query = """
SELECT *
FROM recent
"""
df = pd.read_sql(query, engine)

all_categories = []

for categories_str in df['categories'].dropna():
    cats = categories_str.split()
    all_categories.extend(cats)
    
category_counts = pd.Series(all_categories).value_counts().reset_index()
category_counts.columns = ['category_code', 'count']

In [105]:
print(category_counts.head(20))

        category_code  count
0               cs.CV   1481
1               cs.LG   1445
2               cs.AI   1441
3            quant-ph    579
4               cs.CL    534
5               cs.RO    357
6              hep-th    312
7   cond-mat.mtrl-sci    310
8              hep-ph    307
9               cs.SY    287
10            eess.SY    287
11              gr-qc    284
12        astro-ph.GA    262
13              cs.CR    255
14            math.CO    229
15            math.AP    226
16            stat.ML    219
17            math.OC    214
18            math.MP    213
19            math-ph    213

In [106]:
query_map = """
    SELECT *
    FROM category_map
"""
category_map = pd.read_sql(query_map, engine)
category_map

    category_code                                    category_name
0           cs.AI                          Artificial Intelligence
1           cs.AR                            Hardware Architecture
2           cs.CC                         Computational Complexity
3           cs.CE  Computational Engineering, Finance, and Science
4           cs.CG                           Computational Geometry
..            ...                                              ...
151       stat.ME                                      Methodology
152       stat.ML                                 Machine Learning
153       stat.OT                                 Other Statistics
154       stat.TH                                Statistics Theory
155      astro-ph                                     Astrophysics

[156 rows x 2 columns]

In [107]:
# Merge to get full names
category_counts = category_counts.merge(
    category_map, 
    on='category_code', 
    how='left'
)

In [108]:
category_counts = category_counts.groupby('category_name')['count'].sum().reset_index()
category_counts = category_counts.sort_values('count', ascending=False)
category_counts

                               category_name  count
82                          Machine Learning   1664
33   Computer Vision and Pattern Recognition   1481
7                    Artificial Intelligence   1441
123                          Quantum Physics    579
144                      Systems and Control    574
..                                       ...    ...
55                           General Finance      4
11             Atomic and Molecular Clusters      3
136                      Statistical Finance      3
17       Cellular Automata and Lattice Gases      2
105                   Other Computer Science      2

[148 rows x 2 columns]

### Interesting Trends
#### 1. Most common categories (all-time)

In [81]:
myquery = '''
CREATE TABLE category_counts_alltime AS
WITH exploded AS (
    SELECT
        unnest(string_to_array(categories, ' ')) AS category_code
    FROM papers2
)
SELECT
    category_code,
    COUNT(*) AS count
FROM exploded
GROUP BY category_code
ORDER BY count DESC;
'''

cursor = dbserver.cursor()
cursor.execute(myquery)
dbserver.commit()

In [ ]:
myquery = """
SELECT * 
FROM category_counts_alltime 
ORDER BY count DESC;
"""

pd.read_sql_query(myquery, con=engine)

    category_code   count
0           cs.LG  244287
1          hep-ph  192165
2          hep-th  178313
3           cs.CV  175615
4        quant-ph  171085
..            ...     ...
171       atom-ph     123
172      acc-phys      49
173      plasm-ph      38
174        ao-sci      17
175      bayes-an      16

[176 rows x 2 columns]

#### 2. Average abstract length over time

In [110]:
myquery = r"""
CREATE TABLE abstract_length_by_year AS
SELECT
    submitted_year AS year,
    AVG(array_length(regexp_split_to_array(abstract, '\s+'), 1)) AS avg_length,
    PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY array_length(regexp_split_to_array(abstract, '\s+'), 1)) AS median_length
FROM papers2
GROUP BY year
ORDER BY year;
"""

cursor = dbserver.cursor()
cursor.execute(myquery)
dbserver.commit()

In [111]:
myquery = """
SELECT * 
FROM abstract_length_by_year 
ORDER BY year
"""

pd.read_sql_query(myquery, con=engine)

    year  avg_length  median_length
0   1986   27.000000           27.0
1   1988   89.000000           89.0
2   1989   68.666667           64.5
3   1990   83.269231           68.5
4   1991   85.903683           80.0
5   1992   94.452665           87.0
6   1993   98.349978           89.0
7   1994  102.387180           92.0
8   1995  105.558819           94.0
9   1996  106.813193           94.0
10  1997  109.251096           97.0
11  1998  111.395656           99.0
12  1999  112.372455          100.0
13  2000  113.512928          101.0
14  2001  115.225166          103.0
15  2002  114.985460          103.0
16  2003  116.855587          105.0
17  2004  117.991239          106.0
18  2005  119.922122          108.0
19  2006  121.245618          109.0
20  2007  121.640730          109.0
21  2008  123.997262          112.0
22  2009  126.277161          114.0
23  2010  129.775324          117.0
24  2011  131.352941          119.0
25  2012  134.047740          123.0
26  2013  135.338240          125.0
27  2014  138.386525          130.0
28  2015  140.713859          133.0
29  2016  143.342727          137.0
30  2017  146.195119          141.0
31  2018  149.617160          146.0
32  2019  152.027572          149.0
33  2020  157.219279          154.0
34  2021  159.907879          158.0
35  2022  161.322851          160.0
36  2023  164.034480          163.0
37  2024  165.572083          165.0
38  2025  165.581272          166.0

#### 3. Multicategory share by year

In [119]:
myquery = r"""
CREATE TABLE multicategory_by_year AS
SELECT
    submitted_year AS year,
    SUM(CASE WHEN array_length(string_to_array(categories, ' '), 1) > 1 THEN 1 ELSE 0 END) AS sum,
    (SUM(CASE WHEN array_length(string_to_array(categories, ' '), 1) > 1 THEN 1 ELSE 0 END) * 1.0 / COUNT(*)) AS share
FROM papers2
GROUP BY submitted_year
ORDER BY submitted_year;
"""

cursor = dbserver.cursor()
cursor.execute(myquery)
dbserver.commit()

In [120]:
myquery = """
SELECT * 
FROM multicategory_by_year 
ORDER BY year
"""

pd.read_sql_query(myquery, con=engine)

    year     sum     share
0   1986       1  1.000000
1   1988       0  0.000000
2   1989       4  0.666667
3   1990       8  0.307692
4   1991      20  0.056657
5   1992     658  0.206270
6   1993    1745  0.259325
7   1994    2964  0.294106
8   1995    3939  0.302860
9   1996    4603  0.290008
10  1997    5740  0.292708
11  1998    7153  0.295945
12  1999    8260  0.298195
13  2000    8997  0.293339
14  2001    9987  0.301358
15  2002   11503  0.318581
16  2003   12474  0.316647
17  2004   14510  0.331930
18  2005   15897  0.339093
19  2006   17533  0.348472
20  2007   19930  0.357476
21  2008   22060  0.375106
22  2009   28018  0.437296
23  2010   31556  0.448953
24  2011   35326  0.461163
25  2012   41949  0.497179
26  2013   41824  0.450326
27  2014   43069  0.441326
28  2015   45809  0.435737
29  2016   49294  0.434538
30  2017   51663  0.417374
31  2018   61766  0.440001
32  2019   83943  0.538383
33  2020  102336  0.574034
34  2021  100299  0.552310
35  2022  103528  0.556641
36  2023  116621  0.557400
37  2024  135319  0.555292
38  2025  141698  0.537733